anthropic.claude-code
bradymholt.pgformatter
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
github.copilot-chat
github.vscode-github-actions
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
sdras.night-owl
shd101wyy.markdown-preview-enhanced
simonsiefke.svg-preview
suhelmakkad.shadcn-ui
supabase.vscode-supabase-extension
unifiedjs.vscode-mdx
vitest.explorer
wesbos.theme-cobalt2
yzhang.markdown-all-in-one
